#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт 
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
		Группа = Форма.Элементы.Добавить("ГруппаПересчет", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		//Группа.Заголовок = "Добавлено";  
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				
		ТипРеквизита = Новый ОписаниеТипов("Число");
		
		ДобавляемыеРеквизиты = Новый Массив;
		РеквизитФормы = Новый РеквизитФормы("РеквизитСогласованнаяСкидка", ТипРеквизита, "", "СогласованнаяСкидка");
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
		
		ПолеВвода = Форма.Элементы.Добавить("ЭлементСогласованнаяСкидка", Тип("ПолеФормы"), Группа);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
		ПолеВвода.УстановитьДействие("ПриИзменении", "ПриИзмененииСкидки");
		
		Команда = Форма.Команды.Добавить("Пересчет");
		Команда.Заголовок = "Пересчет";
		Команда.Действие = "Пересчет"; 
		
		КнопкаФормы = Форма.Элементы.Добавить("КнопкаПересчет", Тип("КнопкаФормы"), Группа);
		КнопкаФормы.ИмяКоманды = "Пересчет";
		КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;

	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
			
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);  
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВствитьПолеКонтактноеЛицоВФорму(Форма);
    ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВствитьПолеКонтактноеЛицоВФорму(Форма);
    КонецЕсли;
//-- Абрамова ________31.01.26		
КонецПроцедуры  

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);   
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо"  
//-- Абрамова ________31.01.26
КонецПроцедуры 

Процедура ВствитьПолеКонтактноеЛицоВФорму(Форма)   // Для документов "Оплата от покупателя" и "оплата поставщику"
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.Договор);  
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо" 
		
КонецПроцедуры  



#КонецОбласти